# RvtSourceLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RvtSourceLevel Property
ParameterTypeId Class See Also
---
"Map Levels..."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RvtSourceLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RvtSourceLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RvtSourceLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace